Ran Plan for 2 projects:

1. project: `sg` dir: `examples/sg` workspace: `default`
1. project: `sg-2` dir: `examples/sg-2` workspace: `default`
---

### 1. project: `sg` dir: `examples/sg` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sg
  ```
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sg
  ```

---
### 2. project: `sg-2` dir: `examples/sg-2` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.ex-1 will be created
  + resource "aws_security_group" "ex-1" {
      + arn                    = (known after apply)
      + description            = "Example Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ex-101"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-2"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-041a79e3968e500a4"
    }

  # aws_security_group.ex-2 will be created
  + resource "aws_security_group" "ex-2" {
      + arn                    = (known after apply)
      + description            = "Example Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ex-102"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-2"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-041a79e3968e500a4"
    }

  # aws_security_group.ex-3 will be created
  + resource "aws_security_group" "ex-3" {
      + arn                    = (known after apply)
      + description            = "Example Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ex-103"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-2"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-041a79e3968e500a4"
    }

  # aws_security_group.ex-4 will be created
  + resource "aws_security_group" "ex-4" {
      + arn                    = (known after apply)
      + description            = "Example Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ex-104"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-2"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-041a79e3968e500a4"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sg-2
  ```
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sg-2
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```